---
kind: method
id: M:Autodesk.Revit.DB.FilterNumericEquals.#ctor
source: html/38c79b05-3d3c-9845-30b5-c68eb1f71ba2.htm
---
# Autodesk.Revit.DB.FilterNumericEquals.#ctor Method

Constructs an instance of FilterNumericEquals.

## Syntax (C#)
```csharp
public FilterNumericEquals()
```